import pandas as pd
import json




if __name__ == '__main__':
# 동물
    df_01 = pd.DataFrame(
        [['돼지', '포유류', '정온'], ['닭', '조류', '정온'], ['뱀', '파충류', '변온'], ['개구리', '양서류', '변온'], ['고등어', '어류', '변온']])

# print(df_01)



# index 지정
    df_01_01 = pd.DataFrame(
        [['돼지', '포유류', '정온'], ['닭', '조류', '정온'], ['뱀', '파충류', '변온'], ['개구리', '양서류', '변온'], ['고등어', '어류', '변온']],
        index=['1', '2', '3', '4', '5'])

    # print(df_01_01)



# column 지정
    df_01_02 = pd.DataFrame(
        [['돼지', '포유류', '정온'], ['닭', '조류', '정온'], ['뱀', '파충류', '변온'], ['개구리', '양서류', '변온'], ['고등어', '어류', '변온']],
        columns=['동물 종류', '분류', '체온 유지'])

    # print(df_01_02)



# index, column 지정
    df_01_03 = pd.DataFrame(
        [['돼지', '포유류', '정온'], ['닭', '조류', '정온'], ['뱀', '파충류', '변온'], ['개구리', '양서류', '변온'], ['고등어', '어류', '변온']],
        index=['1', '2', '3', '4', '5'],
        columns=['동물 종류', '분류', '체온 유지'])

    # print(df_01_03)





# 성적
    df_02 = pd.DataFrame({
        'Name' : ['A', 'B', 'C', 'D', 'E'],
                          'Music' : [100, 80, 78, 88, 92],
                          'Art' : [88, 63, 100, 100, 74],
                          'P.E.' : [84, 100, 100, 73, 68]})

    # print(df_02)



# 'name' 컬럼으로 index 지정
    df_02_01 = df_02.set_index('Name')
    # print(df_02_01)





# 나이, 신장, 체중
    df_03 = pd.DataFrame({
        'age': [17, 23, 26],
        'height': [167, 162, 170],
        'weight': [99, 55, 77]
    },
        index=['로이', '로아', '로하'])

    # print(df_03)


